from time import sleep

def schedule(question):
        #Answers the question related to the schedule
    print("Лениво отвечает на ваш вопрос", "...")
    sleep(3)
    #print("Понедельник: \бла-бла/ Вторник: Среда: ")
    #print("- 8 утра: джо")
    #Если не успею или усну
    print('''Понедельник: 
- 8 утра: джоггинг или поход в парк
- 12 дня: прогулка с друзьями
- днем: почитать новую книгу или играть в игры
- вечером: мини-дискотека и пиво с друзьями

Вторник: 
- 8 утра: поход на пляж 
- 12 дня: заниматься йогой или танцевать
- днем: сделать салат и посмотреть сериал
- вечером: посетить концерт акустического музыканта
          
Среда:
- 8 утра: поход в музей
- 12 дня: поездка на велосипеде
- днем: играть в любимую игру или участвовать в соревнованиях
- вечером: просмотр хорошего фильма 

Четверг: 
- 8 утра: поход в кафе 
- 12 дня: посетить театр 
- днем: поход в кинотеатр или з друзьями посетить картинную галерею 
- вечером: квиз или игра в настольные игры с друзьями 

Пятница: 
- 8 утра: поход в парк с близким человеком 
- 12 дня: увлекательное спортивное занятие с друзьями 
- днем: посетить мастер-класс или поход на мастерскую и провести там время
- вечером: играть в политический квиз или поход в музей моды 

Суббота: 
- 8 утра: позавтракать по-новому 
- 12 дня: посетить выставку животных 
- днем: подумать о своей судьбе 
- вечером: пойти в концерт или театральный мюзикл 

Воскресенье: 
- 8 утра: поход в в церковь 
- 12 дня: идти в кинотеатр или музей современного искусства 
- днем: поход в районы древних храмов 
- вечером: сравнение мировоззрений с друзьями в пабе")''')
    # print('Среда:')
    # print('- 8 утра: джоггинг или поход в парк')
    # print('- 12 дня: прогулка с друзьями ')
    # print('- днем: почитать новую книгу или играть в игры')
    # print('- вечером: мини-дискотека и пиво с друзьями ')
    # sleep(3)
    # print("Это вся информация, которой я располагаю.")
    # print("Информация о вас отсутствует")

def charge(question):
            # Use a breakpoint in the code line below to debug your script.
    print("Собирается. Лениво отвечать на ваш вопрос", "...")
    sleep(2)
    print('.......')
    sleep(4)
    print('..........')
    sleep(2)
    print('................Вы слышите странный, звук проносящийся у вас в голове, "напоминающий металлический храп'
          ' шестерёнок"')
    sleep(0.8)
    print("(Интересно почему вы так решили???)")
    sleep(30)
    print("Спустя 30 секунд никто не отвечает. Он. Уснул!")
    sleep(3)
    print("⊶ ⊷ ⊸ ⊹ ⊺ ⊻ ⊼ ⊽ ⊾ ⊿ ⋀ ⋁ ⋂ ⋃ ⋄ ⋅ ⋆ ⋇ ⋈ ⋉ ⋊")
    sleep(0.2)
    print("Загрызка: языка, грамматики и кота мысли завершен=а на 68%")
    print("Система работает корректно, не обращайте внимание. Вопрос, который вы задали, есть в списке " '\033[3m' + 'Табу' ".")
    sleep(2)
    print("Продолжайте пользоваться нашим сервисом! Забудьте свой вопрос как страшный сон!")

def coach(question):
            # Use a breakpoint in the code line below to debug your script.
    print("Лениво отвечает на ваш вопрос", "Спрашиваешь оплату? С тебя 666 умножить на 666 в 666 степени.")

def laziness(question):
            # Use a breakpoint in the code line below to debug your script.
    print('Мне лень отвечать на ваш вопос"', question, ' ваш вопрос, иди за гугли ', '♡(*>ω<)ω<*♡') #Когда задали не подходящий вопрос.

def YUI(question):
    #Use a breakpoint in the code line below to debug your script. #Создатель, Автор посхалка и т.д.
    print('''█░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░░░░░░░░░░░██░░░█░░░░░░░░░
░░░░░░░░░░░░░░░░░░██░░░████░███░░░░░░░░░
░░░░░░░░░░░░░░░░░░██████░░██░█░░░░░░░░░░
░░░░░░░░░░░░░░░░░░█░░██░░░░░░█░░░░░░░░░░
░░░░░░░░░░░░░░░░░░█░░░░░░░░░░█░░░░░░░░░░
░░░░░░░░░░░░░░░███████████████░░░░░░░░░░
░░░░░░░░████████░░░░░░░░░░░░░░█████░░░░░
░░░░░████░░░░░░░░░░░░░░░░░░░░░░░░░███░░░
░░░███░░░░███░░░░░░░░░░░█████░░░░░░░██░░
░░██░░░░░░░░███░░░░░░░░██░░░░░░░░░░░░░█░
░█░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█░
░█░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░██░
░░███████████████████████████████████░░░
░───░░░░░░░░░░░░░░░░░░░░░░░░░░░░░────░░░
░░░───────────────────────────────░░────
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
''')


def router(question):
    while question != "0" or "off" or "хватит" or "щаа" or "выключись":
        #доделать и проверить
        if question.startswith("расп") or question in "расп" or question in "hfcg":
            schedule(question)
            # открыть расписание
        elif question.startswith("трен") or question in "трене" or question in "nhty":
            charge(question)
        elif question.startswith("оплат") or "оплат" in question or "jgkfn" in question:
            coach(question)
        elif question.startswith("автор") or "автор" in question or "fdnjh" in question:
            YUI(question)
        elif question.startswith("пасхалк") or "пасхалк" in question or "gfc[fkr" in question or "посхалк" in question:
            YUI(question)
        elif question.startswith("создат") or question in "создат" or question in "cjplfn":
            YUI(question)
        else:
            laziness(question)

        question = str.lower(input())